; 	sample 1
; $1 = data
; $2 = like a i of 'for'
; $3 = max val 11
; $4 = keeps val 1 for beq
; $5 = LSB of $2
	lui $1,$0,0x10 ; 2進数に直すと00100000
	addi $2,$0,1
	addi $3,$0,11
	addi $4,$0,1
loop: andi $5,$2,1 ; $2が偶数だったら$5=0, 奇数だったら$5=1
	beq $5,$0,skip ; $5 == $0でskipに飛ぶ→$2が偶数だったらスキップする
	add $1,$1,$2 ; $1 = $1 + $2
skip: addi $2,$2,1 ; $2 += 1
	slt $5,$2,$3 ; $2が11未満だったら1, 以上だったら0を$5に代入
	beq $5,$4,loop ; $4 == $5だったらloopに戻る。$4は1で固定。つまり、一個前の処理で、$2が11になったら↓の処理にいける
	ori $1,$1,0x100 ; 論理和
	sw $1,84($0) ; store word
